name: "sam_encoder"
backend: "onnxruntime"
max_batch_size : 0
input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1, 3 ]
  }
]
output [
  {
    name: "image_embeddings"
    data_type: TYPE_FP32
    dims: [ 1, 256, 64, 64 ]
  }
]
